常规统计和分组计算

DataFrame对象的统计函数
sum
mean
median
describe

In [1]:
import numpy as np
import pandas as pd

In [2]:
gdp = pd.read_csv("./gdp-pop.csv")
city_gdp = gdp.set_index("City_Name")
city_gdp

                GDP  Population
City_Name
SHANGHAI   27466.15     2419.70
BEIJING    24899.30     2172.90
GUANGZHOU  19610.90     1350.11
SHENZHEN   19492.60     1137.87
TIANJIN    17885.39     1562.12
CHONGQING  17558.39     3016.55
SUZHOU     15475.09     1375.00
CHENDU     12170.20     1591.76

In [3]:
city_gdp.sum()

GDP           154558.02
Population     14626.01
dtype: float64

In [4]:
city_gdp.mean()

GDP           19319.75250
Population     1828.25125
dtype: float64

In [5]:
city_gdp.median()#中位数

GDP           18688.995
Population     1576.940
dtype: float64

In [6]:
city_gdp.mean(axis=1)

City_Name
SHANGHAI     14942.925
BEIJING      13536.100
GUANGZHOU    10480.505
SHENZHEN     10315.235
TIANJIN       9723.755
CHONGQING    10287.470
SUZHOU        8425.045
CHENDU        6880.980
dtype: float64

In [7]:
city_gdp.describe()#常见统计量

               GDP   Population
count      8.00000     8.000000
mean   19319.75250  1828.251250
std     4908.69651   645.654074
min    12170.20000  1137.870000
25%    17037.56500  1368.777500
50%    18688.99500  1576.940000
75%    20933.00000  2234.600000
max    27466.15000  3016.550000

分组计算

In [8]:
df = pd.DataFrame({'subject':['math', 'physis', 'english', 'math', 'physis', 'english'], 'score':[90, 80, 70, 95, 85, 75]})
df

   subject  score
0     math     90
1   physis     80
2  english     70
3     math     95
4   physis     85
5  english     75

In [9]:
df.groupby('subject')#以某个特征进行分组

In [11]:
df.groupby('subject').sum()

         score
subject
english    145
math       185
physis     165

In [12]:
df['teacher'] = ['Newton', 'Newton', 'Pascal', 'Newton', 'Pascal', 'Pascal']
df['rank'] = [4, 5, 2, 9, 7, 5]
df

   subject  score teacher  rank
0     math     90  Newton     4
1   physis     80  Newton     5
2  english     70  Pascal     2
3     math     95  Newton     9
4   physis     85  Pascal     7
5  english     75  Pascal     5

In [13]:
df.groupby(['teacher', 'subject']).mean()

                 score  rank
teacher subject
Newton  math      92.5   6.5
        physis    80.0   5.0
Pascal  english   72.5   3.5
        physis    85.0   7.0

In [14]:
df.groupby(['teacher', 'subject'])['score'].mean()#指定某一列进行计算

teacher  subject
Newton   math       92.5
         physis     80.0
Pascal   english    72.5
         physis     85.0
Name: score, dtype: float64

In [15]:
df.groupby('teacher').aggregate(['mean', 'std', 'max'])#计算多个统计量

             score                    rank
              mean       std max      mean       std max
teacher
Newton   88.333333  7.637626  95  6.000000  2.645751   9
Pascal   76.666667  7.637626  85  4.666667  2.516611   7

In [16]:
df.groupby('teacher').aggregate({'score':np.mean, 'rank':np.median})#以字典色形式，传入多个参数，对不同的列分别操作

             score  rank
teacher
Newton   88.333333     5
Pascal   76.666667     5

In [17]:
def rank_score(x):
    x['rank_score'] = x['score'] * x['rank'].std()
    return x
df.groupby('subject').apply(rank_score)

   subject  score teacher  rank  rank_score
0     math     90  Newton     4  318.198052
1   physis     80  Newton     5  113.137085
2  english     70  Pascal     2  148.492424
3     math     95  Newton     9  335.875721
4   physis     85  Pascal     7  120.208153
5  english     75  Pascal     5  159.099026

In [20]:
df.groupby('subject').filter

In [21]:
df.groupby('subject').transform